app/views/incidents/show.html.erb

  &lt;!&ndash; List group &ndash;&gt;
<% @incident.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."incident_id" = ?  [["incident_id", 1]]