app/controllers/events_controller.rb

  def create
    @incident = Incident.find(params[:incident_id])
    @event = @incident.events.create(event_params)
---
SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "events" ("description", "status", "incident_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "toto"], ["status", "titi"], ["incident_id", 1], ["created_at", "2016-08-30 08:39:26.480216"], ["updated_at", "2016-08-30 08:39:26.480216"]]