app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

  def create
    @incident = Incident.new(incident_params)
    @incident.status = "open"

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("title", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "toto"], ["description", "toto"], ["status", "open"], ["created_at", "2016-08-30 08:35:16.162183"], ["updated_at", "2016-08-30 08:35:16.162183"]]

  def update
    respond_to do |format|
      if @incident.update(incident_params)
---
UPDATE "incidents" SET "status" = ?, "updated_at" = ? WHERE "incidents"."id" = ?  [["status", "closed"], ["updated_at", "2016-08-31 07:23:27.751302"], ["id", 1]]

    def set_incident
      @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT 1  [["id", 1]]